cf/Documents/Письмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Письмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СвязанныеДокументы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомуСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КопияСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonForms/ТабличныйДокумент/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьНадписьПартнеры()
	
	// Нарисуем вложения красиво
	
	ФормСтроки = Новый Массив;
	
	Инд = -1;
	Для Каждого Строка Из ДополнительныеПараметры Цикл
		
		Если ЗначениеЗаполнено(Строка.Контрагент) Тогда
			ФормСтроки.Добавить(Новый ФорматированнаяСтрока(Строка(Строка.Контрагент),,,,ПолучитьНавигационнуюСсылку(Строка.Контрагент))); КонецЕсли; КонецЦикла;
	
	ПартнерыНадпись = Новый ФорматированнаяСтрока(ФормСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяФайла 			= Параметры.ИмяФайла;
	ТабличныйДокумент 	= Параметры.ТабличныйДокумент;
	
	Если ТипЗнч(Параметры.ДополнительныеПараметры) = Тип("Массив") Тогда
		
		Для Каждого Элемент Из Параметры.ДополнительныеПараметры Цикл ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Добавить(), Элемент) КонецЦикла;
		ОбновитьНадписьПартнеры(); КонецЕсли;
	
	Если ФорматФайла = "" Тогда ФорматФайла = "PDF" КонецЕсли;
	
	Заголовок = ИмяФайла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРасширениеДляФайлаПоТипу(ФорматФайла)
	
	Если ФорматФайла = "XLS97" Тогда
		Возврат "xls";
	Иначе
		Возврат НРег(ФорматФайла); КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция СохранитьВоВременныйФайл()
	
	ТипФайлаВложения = ТипФайлаТабличногоДокумента[ФорматФайла];
	РасширениеФайлаВложения = ПолучитьРасширениеДляФайлаПоТипу(ФорматФайла);
	
	Если ТипФайлаВложения = Неопределено Тогда ТипФайлаВложения = ТипФайлаТабличногоДокумента.PDF КонецЕсли;
	Если ПустаяСтрока(РасширениеФайлаВложения) Тогда РасширениеФайлаВложения = "pdf" КонецЕсли;
	
	ИмяФайлаСохр 	= ИмяФайла + "." + РасширениеФайлаВложения;
	ФулИмяФайла 	= КаталогВременныхФайлов() + ИмяФайлаСохр;
	
	// Сохраним
	
	Попытка
		ТабличныйДокумент.Записать(ФулИмяФайла, ТипФайлаВложения);
		Возврат ФулИмяФайла;
	Исключение
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка при записи макета в файл
											|" + стрОшибки);КонецПопытки;
КонецФункции
&НаКлиенте
Процедура ОтправитьНаЭлектроннуюПочту(Команда)
	
	ФулИмяФайла = СохранитьВоВременныйФайл();
	
	Если ФулИмяФайла <> Неопределено Тогда
		
		// Добавим получателей
		
		Кому = Новый Массив;
		Для Каждого Строка Из ДополнительныеПараметры Цикл 
			
			Структура = Новый Структура("Контрагент", Строка.Контрагент);
			Если Найти(Строка.Почта, "@") Тогда Структура.Вставить("Почта", Строка.Почта); КонецЕсли; 
			
			Кому.Добавить(Структура); КонецЦикла;
		
		// Добавим вложения
		
		Вложения = Новый Массив;
		Вложения.Добавить(Новый Структура("ИмяФайла, ПолноеИмяФайла", ИмяФайла + "." + ПолучитьРасширениеДляФайлаПоТипу(ФорматФайла), ФулИмяФайла));
		
		// Открем письо для отправки
		
		ОткрытьФорму("Документ.Письмо.Форма.Письмо2", 
				Новый Структура("Кому, Вложения, УдалитьФайлыПослеОтправкия", Кому, Вложения),,,,,Новый ОписаниеОповещения("ОповеститьОбОтправкеПисьма", ЭтаФорма)); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОповеститьОбОтправкеПисьма(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СобытияСистемы.ОповеститьОбОтправкеПисьма(Результат, ВладелецФормы) КонецЕсли;
	
КонецПроцедуры
